'''
位运算符
'''

op1 = 6
print(op1)
print(~op1) #按位取反 1111 1000
'''
6的二进制：0000 0110 -> 取反：1111 1001 带着符号位则为负数且为某个负数的补码
根据反码推补码要加1，那现在知道补码推反码就是减1
1111 1001 -> 1111 1000 -> 1000 0111 符号位不变，反码表示就是-7
'''
op2 = 2
print(op2)
print(~op2) #-3
'''
0000 0010 -> 1111 1101 -> 1111 1100 -> 1000 0011
'''
print(op1 | op2) #按位或 6
"""
有1就行：0000 0110 | 0000 0010 => 0000 0110 
"""
print(op1 & op2) #按位与 2
print(op1 ^ op2) #按位异或 4
'''
0和1对应才算：
0000 0110
0000 0010
0000 0100 4
'''
print(op1 >> op2) #按位移
print(op1 << op2)

